<?php
	
	/*
	 * Прилагательные по умолчанию 
	 * Будут подставляться в UserPage в placeholder  по умолчанию
	 */
	 
	class DefaultAdjective extends Model
	{
		
		/*====================================== ПЕРЕМЕННЫЕ И КОНСТАНТЫ ======================================*/

		public static $mysql_table	= "default_adjectives";
		
		/*====================================== СИСТЕМНЫЕ ФУНКЦИИ ======================================*/
		
		
		
		/*====================================== СТАТИЧЕСКИЕ ФУНКЦИИ ======================================*/
		
		/*
		 * Получаем случайное прилагательное
		 * $gender – пол (0 - мужской, 1 - женский)
		 */
		public static function randomAdjective($gender = 0)
		{
			// Получаем все прилагательные по умолчанию
			$DefaultAdjectives = self::findAll();
			
			// Случайный индекс
			$random_index = array_rand($DefaultAdjectives);
			
			// Возвращаем прилагательное в зависимости от пола
			if ($gender) {
				// Если женский
				return $DefaultAdjectives[$random_index]->female;
			} else {
				// Иначе мужской
				return $DefaultAdjectives[$random_index]->male;
			}
		}
				
		/*====================================== ФУНКЦИИ КЛАССА ======================================*/
	}